Tekla Open API Reference for Tekla Structures 2025
AnalysisNode.Position Property
 The position of the analysis node (in the global coordinate system).
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector Position { get; set; }
Public Property Position As Vector
	Get
	Set
Property Value
Type: Vector
See Also
Reference
AnalysisNode Class
Tekla.Structures.Analysis Namespace